historic/results-Samsung_NVMEe_950Pro_256GB/mixed-402-8to16k_20Mseq.fio.out
randread-8k-16k: (g=0): rw=randread, bs=8K-16K/8K-16K/8K-16K, ioengine=libaio, iodepth=10
seqread: (g=0): rw=read, bs=1M-1M/1M-1M/1M-1M, ioengine=libaio, iodepth=10
seqwrite: (g=0): rw=write, bs=1M-1M/1M-1M/1M-1M, ioengine=libaio, iodepth=10
fio-2.2.8
Starting 3 processes

randread-8k-16k: (groupid=0, jobs=1): err= 0: pid=13674: Wed Apr  6 20:08:04 2016
  read : io=46238MB, bw=789114KB/s, iops=98634, runt= 60001msec
    slat (usec): min=1, max=25, avg= 2.21, stdev= 0.67
    clat (usec): min=12, max=5817, avg=98.55, stdev=84.70
     lat (usec): min=15, max=5819, avg=100.83, stdev=84.70
    clat percentiles (usec):
     |  1.00th=[   65],  5.00th=[   66], 10.00th=[   67], 20.00th=[   70],
     | 30.00th=[   79], 40.00th=[   81], 50.00th=[   83], 60.00th=[   87],
     | 70.00th=[   98], 80.00th=[  113], 90.00th=[  135], 95.00th=[  159],
     | 99.00th=[  239], 99.50th=[  506], 99.90th=[ 1208], 99.95th=[ 1384],
     | 99.99th=[ 3760]
    bw (KB  /s): min=752240, max=805456, per=97.47%, avg=789108.10, stdev=11543.11
    lat (usec) : 20=0.01%, 50=0.01%, 100=71.40%, 250=27.72%, 500=0.38%
    lat (usec) : 750=0.18%, 1000=0.19%
    lat (msec) : 2=0.12%, 4=0.01%, 10=0.01%
  cpu          : usr=14.66%, sys=24.99%, ctx=3702263, majf=0, minf=75
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=100.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.1%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued    : total=r=5918185/w=0/d=0, short=r=0/w=0/d=0, drop=r=0/w=0/d=0
     latency   : target=0, window=0, percentile=100.00%, depth=10
seqread: (groupid=0, jobs=1): err= 0: pid=13675: Wed Apr  6 20:08:04 2016
  read : io=1202.0MB, bw=20513KB/s, iops=20, runt= 60002msec
    slat (usec): min=34, max=360, avg=56.28, stdev=17.91
    clat (usec): min=617, max=3841, avg=862.01, stdev=194.42
     lat (usec): min=657, max=4039, avg=918.49, stdev=201.82
    clat percentiles (usec):
     |  1.00th=[  652],  5.00th=[  684], 10.00th=[  708], 20.00th=[  732],
     | 30.00th=[  764], 40.00th=[  852], 50.00th=[  900], 60.00th=[  908],
     | 70.00th=[  916], 80.00th=[  932], 90.00th=[  956], 95.00th=[  972],
     | 99.00th=[ 1048], 99.50th=[ 1976], 99.90th=[ 3600], 99.95th=[ 3856],
     | 99.99th=[ 3856]
    bw (KB  /s): min=20480, max=24526, per=2.54%, avg=20531.72, stdev=377.86
    lat (usec) : 750=26.54%, 1000=71.30%
    lat (msec) : 2=1.66%, 4=0.50%
  cpu          : usr=0.05%, sys=0.11%, ctx=2398, majf=0, minf=548
  IO depths    : 1=99.3%, 2=0.2%, 4=0.3%, 8=0.2%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued    : total=r=1202/w=0/d=0, short=r=0/w=0/d=0, drop=r=0/w=0/d=0
     latency   : target=0, window=0, percentile=100.00%, depth=10
seqwrite: (groupid=0, jobs=1): err= 0: pid=13676: Wed Apr  6 20:08:04 2016
  write: io=1202.0MB, bw=20514KB/s, iops=20, runt= 60001msec
    slat (usec): min=36, max=107, avg=66.38, stdev=14.04
    clat (usec): min=338, max=5465, avg=383.11, stdev=357.90
     lat (usec): min=386, max=5539, avg=449.68, stdev=360.05
    clat percentiles (usec):
     |  1.00th=[  342],  5.00th=[  346], 10.00th=[  346], 20.00th=[  346],
     | 30.00th=[  350], 40.00th=[  350], 50.00th=[  350], 60.00th=[  350],
     | 70.00th=[  354], 80.00th=[  354], 90.00th=[  358], 95.00th=[  362],
     | 99.00th=[  370], 99.50th=[ 3792], 99.90th=[ 5152], 99.95th=[ 5472],
     | 99.99th=[ 5472]
    bw (KB  /s): min=20480, max=24576, per=100.00%, avg=20532.16, stdev=382.53
    lat (usec) : 500=99.17%
    lat (msec) : 4=0.33%, 10=0.50%
  cpu          : usr=0.09%, sys=0.09%, ctx=2520, majf=0, minf=30
  IO depths    : 1=99.3%, 2=0.2%, 4=0.3%, 8=0.2%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued    : total=r=0/w=1202/d=0, short=r=0/w=0/d=0, drop=r=0/w=0/d=0
     latency   : target=0, window=0, percentile=100.00%, depth=10

Run status group 0 (all jobs):
   READ: io=47440MB, aggrb=809614KB/s, minb=20513KB/s, maxb=789114KB/s, mint=60001msec, maxt=60002msec
  WRITE: io=1202.0MB, aggrb=20513KB/s, minb=20513KB/s, maxb=20513KB/s, mint=60001msec, maxt=60001msec

Disk stats (read/write):
    dm-2: ios=5918502/9604, merge=0/0, ticks=582069/2305, in_queue=584773, util=99.88%, aggrios=5927801/9637, aggrmerge=0/0, aggrticks=581991/2322, aggrin_queue=584128, aggrutil=99.82%
  nvme0n1: ios=5927801/9637, merge=0/0, ticks=581991/2322, in_queue=584128, util=99.82%